In [1]:
#Pythonic missing data

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [5]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
78.4 ms ± 1.71 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
3.45 ms ± 195 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [6]:
#missing numeric data

In [7]:
vals2 = np.array([1, np.nan, 3, 4]) 
vals2.dtype

dtype('float64')

In [8]:
1 + np.nan

nan

In [11]:
0 *  np.nan

nan

In [13]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [14]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

In [15]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [16]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [17]:
x[1] = None
x

0    0.0
1    NaN
dtype: float64

In [18]:
data = pd.Series([1, np.nan, 'hello', None])

In [19]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [20]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [21]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [22]:
data[data.isnull()]

1     NaN
3    None
dtype: object

In [23]:
#dropping NA VALUES
data.dropna()

0        1
2    hello
dtype: object

In [24]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [25]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [26]:
df[4]=np.nan

In [27]:
df

     0    1  2   3   4
0  1.0  NaN  2 NaN NaN
1  2.0  3.0  5 NaN NaN
2  NaN  4.0  6 NaN NaN

In [28]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [29]:
df.dropna(axis='columns', how='any')

   2
0  2
1  5
2  6

In [30]:
df.dropna(axis=0, how='all')

     0    1  2   3   4
0  1.0  NaN  2 NaN NaN
1  2.0  3.0  5 NaN NaN
2  NaN  4.0  6 NaN NaN

In [31]:
df.dropna(axis=0, how='any')

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

In [32]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3   4
1  2.0  3.0  5 NaN NaN

In [33]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [34]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [35]:
data.fillna(9)

a    1.0
b    9.0
c    2.0
d    9.0
e    3.0
dtype: float64

In [36]:
# forward-fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [37]:
df

     0    1  2   3   4
0  1.0  NaN  2 NaN NaN
1  2.0  3.0  5 NaN NaN
2  NaN  4.0  6 NaN NaN

In [38]:
df.fillna(method='ffill', axis=1)

     0    1    2    3    4
0  1.0  1.0  2.0  2.0  2.0
1  2.0  3.0  5.0  5.0  5.0
2  NaN  4.0  6.0  6.0  6.0

In [39]:
df.fillna(method='ffill', axis=0)

     0    1  2   3   4
0  1.0  NaN  2 NaN NaN
1  2.0  3.0  5 NaN NaN
2  2.0  4.0  6 NaN NaN

In [40]:
df.fillna(method='bfill', axis=1)

     0    1    2   3   4
0  1.0  2.0  2.0 NaN NaN
1  2.0  3.0  5.0 NaN NaN
2  4.0  4.0  6.0 NaN NaN

In [41]:
df.fillna(method='ffill', axis=0)

     0    1  2   3   4
0  1.0  NaN  2 NaN NaN
1  2.0  3.0  5 NaN NaN
2  2.0  4.0  6 NaN NaN